danieleff/STM32GENERIC/STM32/boards.txt
DISCOVERY_F429ZI.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
DISCOVERY_F429ZI.build.series=STM32F4
DISCOVERY_F429ZI.build.variant=DISCOVERY_F429ZI

DISCOVERY_F429ZI.build.extra_flags=-DSTM32F429ZI -DSTM32F429xx -DHSE_VALUE=8000000
# TODO f_cpu, and check SystemClock_Config() 
# DISCOVERY_F429ZI.build.f_cpu=168000000L

DISCOVERY_F429ZI.upload.protocol=STLink
DISCOVERY_F429ZI.upload.tool=stlink_upload

DISCOVERY_F429ZI.menu.usb.SerialUSB=Serial [Virtual COM port]
DISCOVERY_F429ZI.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
DISCOVERY_F429ZI.menu.usb.SerialMSC=Mass storage [testing, see documentation]
DISCOVERY_F429ZI.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
DISCOVERY_F429ZI.menu.usb.Disabled=Disabled, no USB

DISCOVERY_F429ZI.menu.serial.SerialUSB=SerialUSB
DISCOVERY_F429ZI.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB
DISCOVERY_F429ZI.menu.serial.SerialUART1=SerialUART1 [PA9/PA10]
DISCOVERY_F429ZI.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1

################################################################################
# Discovery F746NG board

DISCOVERY_F746NG.name=Discovery F746NG

DISCOVERY_F746NG.upload.maximum_size=1048576
DISCOVERY_F746NG.upload.maximum_data_size=327680 

DISCOVERY_F746NG.build.core=arduino
DISCOVERY_F746NG.build.board=DISCO_F746NG

DISCOVERY_F746NG.build.mcu=cortex-m7 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
DISCOVERY_F746NG.build.series=STM32F7
DISCOVERY_F746NG.build.variant=DISCOVERY_F746NG
DISCOVERY_F746NG.build.extra_flags=-DSTM32F746NG -DDATA_IN_ExtSDRAM
DISCOVERY_F746NG.build.f_cpu=218000000L

DISCOVERY_F746NG.upload.protocol=STLink
DISCOVERY_F746NG.upload.tool=stlink_upload

DISCOVERY_F746NG.menu.upload_method.STLinkMethod=STLink
DISCOVERY_F746NG.menu.upload_method.STLinkMethod.upload.protocol=STLink
DISCOVERY_F746NG.menu.upload_method.STLinkMethod.upload.tool=stlink_upload

DISCOVERY_F746NG.menu.upload_method.MassStorageMethod=Mass Storage
DISCOVERY_F746NG.menu.upload_method.MassStorageMethod.upload.protocol=
DISCOVERY_F746NG.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher
DISCOVERY_F746NG.menu.upload_method.MassStorageMethod.massstorage_drive=DIS_F746NG

DISCOVERY_F746NG.menu.usb.SerialUSB=Serial [Virtual COM port, PA11/PA12 pins]
DISCOVERY_F746NG.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
DISCOVERY_F746NG.menu.usb.SerialMSC=Mass storage [testing, see documentation]
DISCOVERY_F746NG.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
DISCOVERY_F746NG.menu.usb.Disabled=Disabled, no USB

DISCOVERY_F746NG.menu.serial.SerialUART1=SerialUART1 [Through ST-Link Virtual COM port] [PB7/PA9]
DISCOVERY_F746NG.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
DISCOVERY_F746NG.menu.serial.SerialUSB=SerialUSB
DISCOVERY_F746NG.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB


################################################################################
# DISCO-B-L475E-IOT01A board



DISCO_B_L475E_IOT01A.name=Discovery B-L475E-IOT01A
DISCO_B_L475E_IOT01A.upload.maximum_size=1048576
DISCO_B_L475E_IOT01A.upload.maximum_data_size=131072
DISCO_B_L475E_IOT01A.build.core=arduino
DISCO_B_L475E_IOT01A.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
DISCO_B_L475E_IOT01A.build.series=STM32L4
DISCO_B_L475E_IOT01A.build.variant=DISCO_B_L475E_IOT01A
DISCO_B_L475E_IOT01A.build.board=DISCO_B_L475E_IOT01A
DISCO_B_L475E_IOT01A.build.extra_flags=-DSTM32L475VG
DISCO_B_L475E_IOT01A.massstorage_drive=NODE_L475VG
DISCO_B_L475E_IOT01A.build.f_cpu=80000000L
DISCO_B_L475E_IOT01A.upload.protocol=STLink
DISCO_B_L475E_IOT01A.upload.tool=stlink_upload

DISCO_B_L475E_IOT01A.menu.serial.SerialUART1=SerialUART1 [Through ST-Link Virtual COM port] [PB7/PB6]
DISCO_B_L475E_IOT01A.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
DISCO_B_L475E_IOT01A.menu.serial.SerialUSB=SerialUSB
DISCO_B_L475E_IOT01A.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB

################################################################################
# The Borg board

BORG_F765.name=The Borg

BORG_F765.upload.maximum_size=1048576
BORG_F765.upload.maximum_data_size=524288

BORG_F765.build.core=arduino
BORG_F765.build.board=BORG_F765

BORG_F765.build.mcu=cortex-m7 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -DHSE_VALUE=12000000
BORG_F765.build.series=STM32F7
BORG_F765.build.variant=BORG_F765
BORG_F765.build.extra_flags=-DSTM32F765ZG -DHSE_VALUE=12000000
BORG_F765.build.f_cpu=216000000L

BORG_F765.upload.protocol=STLink
BORG_F765.upload.tool=stlink_upload

BORG_F765.menu.upload_method.STLinkMethod=STLink
BORG_F765.menu.upload_method.STLinkMethod.upload.protocol=STLink
BORG_F765.menu.upload_method.STLinkMethod.upload.tool=stlink_upload

BORG_F765.menu.upload_method.serialMethod=Serial UART1 [TX/PA9, RX/PA10, BOOT0=1, BOOT1=0]
BORG_F765.menu.upload_method.serialMethod.upload.protocol=maple_serial
BORG_F765.menu.upload_method.serialMethod.upload.tool=serial_upload
BORG_F765.menu.upload_method.serialMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

BORG_F765.menu.upload_method.DFUUploadMethod2=USB DFU - Custom bootloader (0x10000)
BORG_F765.menu.upload_method.DFUUploadMethod2.upload.protocol=pico_upload
BORG_F765.menu.upload_method.DFUUploadMethod2.upload.tool=pico_upload
BORG_F765.menu.upload_method.DFUUploadMethod2.build.extra_flags=-DSTM32F765ZG -DVECT_TAB_OFFSET=0x10000 -DHSE_VALUE=12000000
BORG_F765.menu.upload_method.DFUUploadMethod2.build.ldscript=ldscript_bootloader_10000.ld
BORG_F765.menu.upload_method.DFUUploadMethod2.upload.usbID=0483:df11
BORG_F765.menu.upload_method.DFUUploadMethod2.upload.altID=2
BORG_F765.menu.upload_method.DFUUploadMethod2.upload.maximum_size=1048576
BORG_F765.menu.upload_method.DFUUploadMethod2.upload.maximum_data_size=524288
BORG_F765.menu.upload_method.DFUUploadMethod2.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

BORG_F765.menu.usb.SerialUSB=Serial [Virtual COM port, PA11/PA12 pins]
BORG_F765.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
BORG_F765.menu.usb.Disabled=Disabled, no USB

BORG_F765.menu.serial.Automatic=Automatically selected based on upload method
BORG_F765.menu.serial.SerialUSB=SerialUSB
BORG_F765.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB
BORG_F765.menu.serial.SerialUART1=SerialUART1
BORG_F765.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1


################################################################################
